Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoFittingLoadedInProjectError Property
 The fitting that is converted to was not defined. Please load one fitting family and assign it in the routing preference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFittingLoadedInProjectError { get; }
Public Shared ReadOnly Property NoFittingLoadedInProjectError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFittingLoadedInProjectError {
	FailureDefinitionId^ get ();
}
static member NoFittingLoadedInProjectError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace